#pragma once
/* ========================================================================
/* include space
/* ===================================================================== */
#include <Engine/Application/UI/EngineUI/IOnViewportTool.h>

/*-----------------------------------------------------------------------------------------
 * DebugTextOverlay
 * - デバッグテキストオーバーレイクラス
 * - ビューポート上に任意のデバッグテキストを表示するためのクラス
 *---------------------------------------------------------------------------------------*/
namespace CalyxEngine {
	class DebugTextOverlay final
		: public BaseOnViewportTool {
	public:
		//===================================================================*/
		//					methods
		//===================================================================*/
		DebugTextOverlay();
		~DebugTextOverlay() override;

		/**
		 * ビューポート上にデバッグテキストを描画
		 * - basePos: ビューポート左上のスクリーン座標
		 */
		void RenderOverlay(const ImVec2& basePos) override;

	private:
		//===================================================================*/
		//					fields
		//===================================================================*/
	};
} // namespace CalyxEngine
